{
  "sdk_landing_title": "حزمة TWK SDK",
"sdk_landing_subtitle": "ابدأ رحلتك في دمج تطبيقك داخل توكلنا. حمّل TWK SDK واستفد من أسرع طريقة لإطلاق خدماتك ",
  "sdk_landing_cta_open_repo": "ابدا التطوير",
  "sdk_landing_cta_docs": "شوف طريقة الربط",

  "sdk_landing_what_is_title": "إيش هي حزمة TWK SDK؟",
  "sdk_landing_what_is_body": "هي ملف TypeScript خفيف + طبقة JavaScript يخلّي تطبيقك الويب يتواصل مع طبقة TWK الأصلية بشكل آمن وواضح.",
  "sdk_landing_what_is_item_1": "دوال جاهزة لمعلومات الجهاز، بيانات المستخدم، بدون ما تكتب كل شيء من الصفر.",
  "sdk_landing_what_is_item_2": "توقيع HMAC SHA-256 ينحسب لك أوتوماتيكي مع كل نداء يطلع من التطبيق.",
  "sdk_landing_what_is_item_3": "كل اللي عليك تضبط TWKAPIBASE و SHAREDSECRET و ENABLELOG في صفحة الاستضافة قبل ما تبدأ تستخدم الطبقة.",
  "sdk_landing_what_is_item_4": "تشتغل مع أي إطار تحبّه: Angular، React، Vue أو حتى JavaScript عادي.",

  "sdk_landing_quick_title": "كيف أبدأ بسرعة؟",
  "sdk_landing_quick_step_1": "استنسخ مستودع الـ SDK من Bitbucket أو نزّله كملف مضغوط على جهازك.",
  "sdk_landing_quick_step_2": "انسخ twk-sdk.ts داخل كود مشروعك، وحط twkhelper.js في مجلد الـ assets أو أي مجلد للملفات الثابتة.",
  "sdk_landing_quick_step_3": "في صفحة الـ HTML، عرّف المتغيرات TWKAPIBASE و SHAREDSECRET و ENABLELOG قبل ما تحمّل ملف twkhelper.js.",
  "sdk_landing_quick_step_4": "استورد TwkSdk، نادِ TwkSdk.init(...) مرة وحدة عند تشغيل التطبيق، وبعدها استخدم دوال مثل getDeviceInfo و getUserFullName وقت ما تحتاج.",

  "sdk_landing_docs_title": "دليل حزمة الـ SDK",
  "sdk_landing_env_title": "الإعدادات وبيئة العمل",
  "sdk_landing_env_body": "تطبيقك هو اللي يحدد رابط واجهات الـ API وقيمة السر المشترك. إذا ضبطتها صح قبل تحميل twkhelper.js، كل الطلبات تكون موقّعة وآمنة.",
  "sdk_landing_appearance_title": "المظهر والوضع الداكن",
  "sdk_landing_appearance_body_1": "مثال Angular في المشروع يوضح كيف نجيب اللغة ووضع المظهر من TWK.getDeviceInfo() ونطبّق الوضع الداكن أو الفاتح تلقائي.",
  "sdk_landing_appearance_body_2": "تقدر تطبّق نفس الفكرة في واجهتك، أو تكتفي باستخدام الـ SDK للتكامل بدون ما تغيّر تصميم واجهة المستخدم.",
  "sdk_landing_keys_title": "أهم دوال TWK",
  "sdk_landing_keys_body": "طبقة TWK يعطيك مجموعة دوال جاهزة، تقدر تستدعيها مباشرة أو عن طريق TwkSdk حسب اللي يناسبك في مشروعك.",

  "sdk_landing_why_title": "ليش نحتاج هذي الحزمة لخدمات توكلنا؟",
"sdk_landing_why_body_1": "خدمات توكلنا هي خدمات مصغّرة (Mini-Apps) تنعرض داخل تطبيق توكلنا بدون ما تكون تطبيق مستقل. كل خدمة لها واجهاتها وبياناتها، لكنها تعتمد على هوية المستخدم وقنوات الأمان الخاصة بتوكلنا.",
"sdk_landing_why_body_2": "حزمة TWK SDK توفر طريقة موحّدة وآمنة لبناء هذي الخدمات المصغّرة، بحيث ما يحتاج مطور يعيد بناء التكامل مع توكلنا في كل خدمة. الـ SDK يتكفّل بالأمان، التوقيع، الهيدرز، والوصول لقدرات الجهاز، والمطور يركز فقط على منطق الخدمة وتصميم تجربة المستخدم.",

  "sdk_landing_copy_button": "انسخ الكود",
  "sdk_landing_copy_done": "تم نسخ الكود في الحافظة"
}


